In [1]:
import pandas as pd

# Series
- 1-dimensional

In [4]:
series = pd.Series(['BMW', 'Aston Martin'])
series
colors = pd.Series(['Red', 'Silver'])

# Dataframe
- 2-dimensional (rows + cols)

## Import
- csv: `pd.read_csv(csv-name)`

## Export
- csv: `pd.to_csv(csv-name)`

In [5]:
car_data = pd.DataFrame({'Car Make': series, 'Color': colors})
car_data

       Car Make   Color
0           BMW     Red
1  Aston Martin  Silver

## Describe Data

In [6]:
car_sales = pd.read_csv('https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/refs/heads/master/data/car-sales.csv')

In [10]:
# Metadata
print(car_sales.dtypes)
print(car_sales.columns)
print(car_sales.index)

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object
Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')
RangeIndex(start=0, stop=10, step=1)

In [11]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [12]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

# Selecting & Viewing Data
## `loc`
Refers to the position or identifier
## `iloc`
Refers to the index

In [16]:
# loc & iloc
animals = pd.Series(['cat', 'dog', 'panda', 'snake', 'tiger'], index=[0,3,9,8,3])
animals.loc[3]

3      dog
3    tiger
dtype: object

In [17]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [18]:
animals.iloc[3]

'snake'

In [19]:
car_sales['Make'] == 'BMW'

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: Make, dtype: bool

In [20]:
car_sales[car_sales['Make'] == 'BMW']

  Make Colour  Odometer (KM)  Doors       Price
3  BMW  Black          11179      5  $22,000.00